name: "CaffeNet"
layer {
  name: "data"
  type: "RenderData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
# mean pixel / channel-wise mean instead of mean image
  transform_param {
    crop_size: 72
    mean_value: 104
#    mirror: true
  }
  image_data_param {
    # root_folder: "/nfs.yoda/xiaolonw/gan_render/data/"
    root_folder: "/scratch/xiaolonw/render_data/"
    source: "/nfs.yoda/xiaolonw/gan_render/genNormalCodeReg/trainlist_rand.txt"
    batch_size: 20
    new_height: 72
    new_width: 72
    crop_size: 72
#    shuffle: true

  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.05  # sqrt(2 / (32 * 5 * 5))
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}



layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "bn1"
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "bn1"
  top: "bn1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "bn1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    stride: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.0354  # sqrt(2 / (64 * 5 * 5))
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}

layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "bn2"
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "bn2"
  top: "bn2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "bn2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.0417 # sqrt(2 / (128 * 3 * 3))
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "bn3"
}


layer {
  name: "relu3"
  type: "ReLU"
  bottom: "bn3"
  top: "bn3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "bn3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.0295 # sqrt(2 / (256 * 3 * 3))
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}

layer {
  name: "bn4"
  type: "BatchNorm"
  bottom: "conv4"
  top: "bn4"
}

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "bn4"
  top: "bn4"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "bn4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.0295  # sqrt(2 / (256 * 3 * 3))
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
  name: "bn5"
  type: "BatchNorm"
  bottom: "conv5"
  top: "bn5"
}

layer {
  name: "relu5"
  type: "PReLU"
  bottom: "bn5"
  top: "bn5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}

layer {
  name: "upsample5"
  type: "Deconvolution"
  bottom: "bn5"
  top: "upsample5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 4
    stride: 2
  }
}


layer {
  name: "conv6"
  type: "Convolution"
  bottom: "upsample5"
  top: "conv6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    # pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.0417 # sqrt(2 / (128 * 3 * 3))
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
  name: "bn6"
  type: "BatchNorm"
  bottom: "conv6"
  top: "bn6"
}


layer {
  name: "relu6"
  type: "PReLU"
  bottom: "bn6"
  top: "bn6"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}

layer {
  name: "conv7"
  type: "Convolution"
  bottom: "bn6"
  top: "conv7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.0589 # sqrt(2 / (64 * 3 * 3))
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
  name: "bn7"
  type: "BatchNorm"
  bottom: "conv7"
  top: "bn7"
}


layer {
  name: "relu7"
  type: "PReLU"
  bottom: "bn7"
  top: "bn7"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}



layer {
  name: "upsample7"
  type: "Deconvolution"
  bottom: "bn7"
  top: "upsample7"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 4
    stride: 2
  }
}


layer {
  name: "conv8"
  type: "Convolution"
  bottom: "upsample7"
  top: "conv8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1  # 2
    stride: 1
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.0500  # sqrt(2 / (32 * 5 * 5))
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
  name: "bn8"
  type: "BatchNorm"
  bottom: "conv8"
  top: "bn8"
}


layer {
  name: "relu8"
  type: "PReLU"
  bottom: "bn8"
  top: "bn8"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}



layer {
  name: "conv9"
  type: "Convolution"
  bottom: "bn8"
  top: "conv9"
  param {
    lr_mult: 1
    decay_mult: 1
  }     
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 3
    pad: 2
    stride: 1
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01   # 0.1633 = sqrt(2 / (3 * 5 * 5))
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


