name: "CaffeNet"
input: "data"
input_dim: 200
input_dim: 3
input_dim: 227
input_dim: 227


layer {
  name: "conv1" type: "Convolution" bottom: "data" top: "conv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 4 pad: 1 stride: 2
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } 
  }
}

layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "bn1"
}

layer {
  name: "relu1" type: "ReLU" bottom: "bn1" top: "bn1" 
}
layer {
  name: "pool1" type: "Pooling" bottom: "bn1" top: "pool1"
  pooling_param { pool: MAX kernel_size: 3 pad: 0 stride: 2 }
}

layer {
  name: "conv2" type: "Convolution" bottom: "pool1" top: "conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 4 pad: 1 stride: 2 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}

layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "bn2"
}

layer { 
  name: "relu2" type: "ReLU" bottom: "bn2" top: "bn2" 
}
layer {
  name: "pool2" type: "Pooling" bottom: "bn2" top: "pool2"
  pooling_param { pool: MAX kernel_size: 3 pad: 0 stride: 2 }
}

layer {
  name: "conv3" type: "Convolution" bottom: "pool2" top: "conv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 kernel_size: 4 pad: 1 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } 
  }
}

layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "bn3"
}

layer {
  name: "relu3" type: "ReLU" bottom: "bn3" top: "bn3"  
}
layer {
  name: "conv4" type: "Convolution" bottom: "bn3" top: "conv4"
  param { lr_mult: 1 decay_mult: 1}
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 512 kernel_size: 4 pad: 1 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}

layer {
  name: "bn4"
  type: "BatchNorm"
  bottom: "conv4"
  top: "bn4"
}


layer {
  name: "relu4" type: "ReLU" bottom: "bn4" top: "bn4" 
}


